 gcc -g p2final.c
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x722: file p2final.c, line 10.
(gdb) r
Starting program: /home/runner/IA1-Revision/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:10
10    a = input();
(gdb) n
Enter number: n
11    b = input();
(gdb) n
12    c = input();
(gdb) n
14    int largestNumber = large(a,b,c);
(gdb) n
16    output(a,b,c,largestNumber);
(gdb) n
17    return 0;
(gdb) n
18  }
(gdb) n
n__libc_start_main (main=0x555ae1c0071a <main>, argc=1, argv=0x7ffdc1b528e8, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffdc1b528d8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) nn
Undefined command: "nn".  Try "help".
(gdb) c
Continuing.
Enter number: Enter number: the largest number among 32528,32528,32528 id 32528[Inferior 1 (process 1927) exited normally]
(gdb) q
 