 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b amin
Function "amin" not defined.
Make breakpoint pending on future shared library load? (y or [n]) b main
Please answer y or [n].
Make breakpoint pending on future shared library load? (y or [n]) n
(gdb) b main
Breakpoint 1 at 0x722: file p7final.c, line 17.
(gdb) r
Starting program: /home/runner/IA1-Revision/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:17
17      c1 = input();
(gdb) n
Enter the Real part: n
Enter the Imaginary part : n
18      c2 = input();
(gdb) n
Enter the Real part: 12
Enter the Imaginary part : 35n
20      sum = add(c1, c2);
(gdb) s
add (a=..., b=...) at p7final.c:39
39      sum.real = a.real + b.real;
(gdb) n
40      sum.imaginary = a.imaginary + b.imaginary;
(gdb) n
41      return sum;
(gdb) n
42  }
(gdb) n
main () at p7final.c:21
21      output(c1, c2, sum);
(gdb) n

1st complex number = -0.0 + 0.0i
2nd complex number = 12.0 + 35.0i
the answer 12.00 + 35.00i: 
22      return 0;
(gdb) n
23  }
(gdb) c
Continuing.
[Inferior 1 (process 169) exited normally]
(gdb) q